Jamison Hunter

June 30, 2023

# Sakila Queries

![png](sakila-db-model.png)

Create a new repository and notebook for this assignment.

Using the Sakila database, complete the below queries with Python in your Jupyter Notebook.
* You can use MySQL Workbench to test your queries and then copy and paste them into your notebook to perform with Pandas and SQLAlchemy.

In [1]:
# Imports
import pandas as pd
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine

In [2]:
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
username = "root"
password = "root" 
db_name = "sakila"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"

In [3]:
# creating engine
engine = create_engine(connection)

In [20]:
# checking if everything is properly connected and queries are functional
q = """SELECT * FROM actor;"""
pd.read_sql(q, engine).head()

   actor_id first_name     last_name         last_update
0         1   PENELOPE       GUINESS 2006-02-14 12:34:33
1         2       NICK      WAHLBERG 2006-02-14 12:34:33
2         3         ED         CHASE 2006-02-14 12:34:33
3         4   JENNIFER         DAVIS 2006-02-14 12:34:33
4         5     JOHNNY  LOLLOBRIGIDA 2006-02-14 12:34:33

What query would you run to get all the customers inside city_id = 312? Your query should return the customers' first name, last name, email, address, and city.

In [21]:
# finding which city is represented by city_id = 312 and printing the individuals located there
q = """SELECT
c.first_name, c.last_name, c.email, a.address, city.city
FROM customer as c
JOIN 
address AS a ON c.address_id = a.address_id
JOIN 
city ON a.city_id = city.city_id
WHERE 
a.city_id = 312;"""
pd.read_sql(q, engine).head()

,first_name,last_name,email,address,city
0,MATTIE,HOFFMAN,MATTIE.HOFFMAN@sakilacustomer.org,1497 Yuzhou Drive,London
1,CECIL,VINES,CECIL.VINES@sakilacustomer.org,548 Uruapan Street,London

What query would you run to get all comedy films? Note that the genre is called the category in this schema. Your query should return film title, description, release year, rating, and special features.

In [26]:
# accessing all comedy films by joining film_category with category
q = """SELECT
film.title, film.description, film.release_year, film.rating, film.special_features, category.name AS category_name
FROM 
film 
JOIN
film_category ON film.film_id = film_category.film_id
JOIN
category ON category.category_id = film_category.category_id
WHERE
category.name = 'Comedy'"""
pd.read_sql(q, engine).info()
pd.read_sql(q, engine).head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 58 entries, 0 to 57
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   title             58 non-null     object
 1   description       58 non-null     object
 2   release_year      58 non-null     int64
 3   rating            58 non-null     object
 4   special_features  58 non-null     object
 5   category_name     58 non-null     object
dtypes: int64(1), object(5)
memory usage: 2.8+ KB

,title,description,release_year,rating,special_features,category_name
0,AIRPLANE SIERRA,A Touching Saga of a Hunter And a Butler who m...,2006,PG-13,"Trailers,Deleted Scenes",Comedy
1,ANTHEM LUKE,A Touching Panorama of a Waitress And a Woman ...,2006,PG-13,"Deleted Scenes,Behind the Scenes",Comedy
2,BRINGING HYSTERICAL,A Fateful Saga of a A Shark And a Technical Wr...,2006,PG,Trailers,Comedy
3,CAPER MOTIONS,A Fateful Saga of a Moose And a Car who must P...,2006,G,"Trailers,Commentaries,Deleted Scenes",Comedy
4,CAT CONEHEADS,A Fast-Paced Panorama of a Girl And a A Shark ...,2006,G,"Commentaries,Deleted Scenes",Comedy

What query would you run to get all the films that Johnny Lollobrigida was in? Your query should return the actor's last name, film title, and release year.

In [27]:
# finding Johnny Lollobrigida's films
q = """SELECT
actor.first_name, actor.last_name, film.title, film.release_year
FROM
actor
JOIN
film_actor ON actor.actor_id = film_actor.actor_id
JOIN 
film ON film_actor.film_id = film.film_id
WHERE
actor.first_name = 'Johnny'
AND 
actor.last_name = 'Lollobrigida';"""
pd.read_sql(q, engine).info()
pd.read_sql(q, engine).head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29 entries, 0 to 28
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   first_name    29 non-null     object
 1   last_name     29 non-null     object
 2   title         29 non-null     object
 3   release_year  29 non-null     int64
dtypes: int64(1), object(3)
memory usage: 1.0+ KB

  first_name     last_name                 title  release_year
0     JOHNNY  LOLLOBRIGIDA          AMADEUS HOLY          2006
1     JOHNNY  LOLLOBRIGIDA      BANGER PINOCCHIO          2006
2     JOHNNY  LOLLOBRIGIDA      BONNIE HOLOCAUST          2006
3     JOHNNY  LOLLOBRIGIDA           CHITTY LOCK          2006
4     JOHNNY  LOLLOBRIGIDA  COMMANDMENTS EXPRESS          2006

What query would you run to get the first and last names of all the actors in the movie titled "Bingo Talented"?

In [28]:
q = """SELECT
actor.first_name, actor.last_name
FROM
actor
JOIN
film_actor ON actor.actor_id = film_actor.actor_id
WHERE
film_actor.film_id = (SELECT
film_id
FROM 
film
WHERE
film.title = "Bingo Talented");"""
pd.read_sql(q, engine)

  first_name    last_name
0     GOLDIE        BRODY
1    CAMERON         WRAY
2       CARY  MCCONAUGHEY
3        JON        CHASE
4      RENEE         BALL

What query would you run to get the customer_id associated with all payments greater than twice the average payment amount? (HINT: use 2* in your query to get twice the amount). Your result should include the customer id and the amount.

In [31]:
# finding the average payment amount
q = """SELECT 
customer_id, amount
FROM
payment
WHERE
amount > 2 * (SELECT AVG(amount) FROM payment);"""
pd.read_sql(q, engine).info()
pd.read_sql(q, engine).head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 857 entries, 0 to 856
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   customer_id  857 non-null    int64
 1   amount       857 non-null    float64
dtypes: float64(1), int64(1)
memory usage: 13.5 KB

   customer_id  amount
0            1    9.99
1            2   10.99
2            3    8.99
3            3   10.99
4            3    8.99

What query would you run to list the first and last names of the 5 customers who have the highest number(count) of payments? You can title the number of payments as num_payments.

In [32]:
q = """SELECT 
customer.first_name, customer.last_name, 
(SELECT COUNT(*) 
FROM 
payment 
WHERE
payment.customer_id = customer.customer_id)
AS num_payments
FROM
customer
ORDER BY num_payments DESC LIMIT 5;"""
pd.read_sql(q, engine)

  first_name last_name  num_payments
0    ELEANOR      HUNT            46
1       KARL      SEAL            45
2     MARCIA      DEAN            42
3      CLARA      SHAW            42
4      TAMMY   SANDERS            41